[
{"page": 6, "position": 7, "title": "Software Engineer II", "company": "Microsoft", "date": "Today", "application_link": "https://www.indeed.com/m/basecamp/viewjob?viewtype=embedded&jk=79c5b80dd719ba0f", "description": "<div>\n <div>\n  Want to work on one of the world’s largest distributed services and to build a platform affecting billions of people around the world? Then join us in Microsoft Azure Storage team where we are building the platform that is the backbone of the entire Azure Cloud and is capable of storing Exabytes of user data.\n </div>\n <div></div>\n <div>\n  <br> As a Software Engineer II in the Azure Storage Health team you will be building and operating intelligent services that help us detect and repair software issues and run our storage infrastructure reliably. You will build large scale distributed systems, use machine learning and AI techniques and build services that have direct impact to Azure’s customers. You will work and learn with passionate engineers who are deeply experienced and motivated in solving challenges related to durability, availability and concurrency while servicing millions of requests per second.\n </div>\n <div></div>\n <div>\n  <br> Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n </div>\n <h2 class=\"jobSectionHeader\"><b> Responsibilities</b></h2>\n <ul>\n  <li> Design, implement, test and document Azure Storage infrastructure features (using C++ / C#).</li>\n  <li> Improve existing design and code, find solutions to complex problems in a highly scalable distributed environment.</li>\n  <li> Provide technical leadership, mentor team members, improve our engineering processes, drive adoption of industry best practices.</li>\n  <li> Participate in service live-site, measure, monitor and improve performance/stability of the team’s services/components.</li>\n  <li> Obsess over providing the best possible experience to our customers.</li>\n  <li> Work well with others and be a positive influence on the team.</li>\n </ul>\n <h2 class=\"jobSectionHeader\"><b> Qualifications</b></h2>\n <div>\n  <b> Minimum/Required Qualifications:</b>\n </div>\n <ul>\n  <li> Bachelor's Degree in Computer Science, or related technical discipline AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python </li>\n  <div>\n   <ul>\n    <li>OR equivalent experience.</li>\n   </ul>\n  </div>\n  <li>\n   <div>\n     2+ years of experience building large scale distributed systems\n   </div></li>\n  <li>\n   <div>\n     2+ years of experience designing, implementing, testing and documenting infrastructure features\n   </div></li>\n </ul>\n <div></div>\n <div>\n  <b><br> Other Requirements:</b>\n </div>\n <div>\n   Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n </div>\n <ul>\n  <li> Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.</li>\n </ul>\n <div></div>\n <div>\n  <b><br> Additional/Preferred Qualifications: </b>\n </div>\n <ul>\n  <li>Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n   <ul>\n    <li> OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li>\n    <li> OR equivalent experience</li>\n   </ul></li>\n </ul>\n <div></div>\n <div>\n  <br> Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n </div>\n <div></div>\n <div>\n  <br> Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n </div>\n <div></div>\n <div>\n  <br> Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n </div>\n <div></div>\n <div>\n  <br> Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\n </div>\n <div></div>\n <div>\n  <br> #azurecorejobs\n </div>\n</div>"},
{"page": 6, "position": 14, "title": "Software Engineer - Backend", "company": "Databricks", "date": "Today", "application_link": "https://www.indeed.com/m/basecamp/viewjob?viewtype=embedded&jk=1e9ca73721038c2b", "description": "<div>\n <p>At Databricks, we are passionate about enabling data teams to solve the world's toughest problems — from making the next mode of transportation a reality to accelerating the development of medical breakthroughs. We do this by building and running the world's best data and AI infrastructure platform so our customers can use deep data insights to improve their business. Founded by engineers — and customer obsessed — we leap at every opportunity to solve technical challenges, from designing next-gen UI/UX for interfacing with data to scaling our services and infrastructure across millions of virtual machines. And we're only getting started.</p> \n <p> As a software engineer with a backend focus, you will work with your team to build infrastructure and products for the Databricks platform at scale.</p> \n <p><b> The impact you'll have: </b></p>\n <p>Our backend teams span many domains, from our core compute fabric resource management infrastructure, to service platforms, to machine learning infrastructure. For instance, you might work on challenges such as:</p> \n <ul> \n  <li>Resource management infrastructure powering the big data and machine learning workloads on the Databricks platform in a scalable, secure, and cloud-agnostic way</li> \n  <li>Develop reliable, scalable services and client libraries that work with massive amounts of data on the cloud, across geographic regions and Cloud providers</li> \n  <li>Build tools to allow Databricks engineers to operate their services across different clouds and environments</li> \n  <li>Build services, products and infrastructure at the intersection of machine learning and distributed systems.</li> \n </ul> \n <p><b>What we look for:</b></p> \n <ul> \n  <li>BS (or higher) in Computer Science, or a related field</li> \n  <li>2+ years of production level experience in one of: Java, Scala, C++, or similar language.</li> \n  <li>Experience developing large-scale distributed systems.</li> \n  <li>Experience working on a SaaS platform or with Service-Oriented Architectures.</li> \n  <li>Experience with cloud technologies, e.g. AWS, Azure, GCP, Docker, or Kubernetes.</li> \n  <li>Experience with security and systems that handle sensitive data.</li> \n  <li>Good knowledge of SQL.</li> \n </ul> \n <p><b>Benefits</b></p> \n <ul> \n  <li>Comprehensive health coverage including medical, dental, and vision</li> \n  <li>401(k) Plan</li> \n  <li>Equity awards</li> \n  <li>Flexible time off</li> \n  <li>Paid parental leave</li> \n  <li>Family Planning</li> \n  <li>Gym reimbursement</li> \n  <li>Annual personal development fund</li> \n  <li>Work headphones reimbursement</li> \n  <li>Employee Assistance Program (EAP)</li> \n  <li>Business travel accident insurance</li> \n </ul> \n <p><b>COVID-19 Vaccination Requirement</b></p> \n <p> As a federal government contractor, Databricks requires new U.S. employees to be fully vaccinated against COVID-19. Proof of vaccination will be required as a condition of employment. Databricks will make reasonable accommodations based on medical conditions or religious grounds for qualified candidates in accordance with applicable law.</p>\n <div>\n  <p><b> About Databricks</b></p> \n  <p> Databricks is the data and AI company. More than 9,000 organizations worldwide — including Comcast, Condé Nast, and over 50% of the Fortune 500 — rely on the Databricks Lakehouse Platform to unify their data, analytics and AI. Databricks is headquartered in San Francisco, with offices around the globe. Founded by the original creators of Apache Spark™, Delta Lake and MLflow, Databricks is on a mission to help data teams solve the world’s toughest problems. To learn more, follow Databricks on Twitter, LinkedIn and Facebook.</p> \n  <p><b> Our Commitment to Diversity and Inclusion</b></p> \n  <p> At Databricks, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Databricks are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics.</p> \n  <p><b> Compliance</b></p> \n  <div>\n    If access to export-controlled technology or source code is required for performance of job duties, it is within Employer's discretion whether to apply for a U.S. government license for such positions, and Employer may decline to proceed with an applicant on this basis alone.\n  </div>\n </div>\n</div>"},
{"page": 6, "position": 13, "title": "Senior Software Engineer - Backend", "company": "Databricks", "date": "Just posted", "application_link": "https://www.indeed.com/m/basecamp/viewjob?viewtype=embedded&jk=16c536e2badc845c", "description": "<div>\n <p>At Databricks, we are passionate about enabling data teams to solve the world's toughest problems — from making the next mode of transportation a reality to accelerating the development of medical breakthroughs. We do this by building and running the world's best data and AI infrastructure platform so our customers can use deep data insights to improve their business. Founded by engineers — and customer obsessed — we leap at every opportunity to solve technical challenges, from designing next-gen UI/UX for interfacing with data to scaling our services and infrastructure across millions of virtual machines. And we're only getting started.</p> \n <p> As a software engineer with a backend focus, you will work with your team to build infrastructure and products for the Databricks platform at scale.</p> \n <p><b> The impact you'll have: </b></p>\n <p>Our backend teams span many domains, from our core compute fabric resource management infrastructure, to service platforms, to machine learning infrastructure. For instance, you might work on challenges such as:</p> \n <ul> \n  <li>Resource management infrastructure powering the big data and machine learning workloads on the Databricks platform in a scalable, secure, and cloud-agnostic way</li> \n  <li>Develop reliable, scalable services and client libraries that work with massive amounts of data on the cloud, across geographic regions and Cloud providers</li> \n  <li>Build tools to allow Databricks engineers to operate their services across different clouds and environments</li> \n  <li>Build services, products and infrastructure at the intersection of machine learning and distributed systems.</li> \n </ul> \n <p><b>What we look for:</b></p> \n <ul> \n  <li>BS (or higher) in Computer Science, or a related field</li> \n  <li>5+ years of production level experience in one of: Java, Scala, C++, or similar language.</li> \n  <li>Experience developing large-scale distributed systems.</li> \n  <li>Experience working on a SaaS platform or with Service-Oriented Architectures.</li> \n  <li>Experience with cloud technologies, e.g. AWS, Azure, GCP, Docker, or Kubernetes.</li> \n  <li>Experience with security and systems that handle sensitive data.</li> \n  <li>Good knowledge of SQL.</li> \n </ul> \n <p><b>Benefits</b></p> \n <ul> \n  <li>Comprehensive health coverage including medical, dental, and vision</li> \n  <li>401(k) Plan</li> \n  <li>Equity awards</li> \n  <li>Flexible time off</li> \n  <li>Paid parental leave</li> \n  <li>Family Planning</li> \n  <li>Gym reimbursement</li> \n  <li>Annual personal development fund</li> \n  <li>Work headphones reimbursement</li> \n  <li>Employee Assistance Program (EAP)</li> \n  <li>Business travel accident insurance</li> \n </ul> \n <p><b>COVID-19 Vaccination Requirement</b></p> \n <p> As a federal government contractor, Databricks requires new U.S. employees to be fully vaccinated against COVID-19. Proof of vaccination will be required as a condition of employment. Databricks will make reasonable accommodations based on medical conditions or religious grounds for qualified candidates in accordance with applicable law.</p>\n <div>\n  <p><b> About Databricks</b></p> \n  <p> Databricks is the data and AI company. More than 9,000 organizations worldwide — including Comcast, Condé Nast, and over 50% of the Fortune 500 — rely on the Databricks Lakehouse Platform to unify their data, analytics and AI. Databricks is headquartered in San Francisco, with offices around the globe. Founded by the original creators of Apache Spark™, Delta Lake and MLflow, Databricks is on a mission to help data teams solve the world’s toughest problems. To learn more, follow Databricks on Twitter, LinkedIn and Facebook.</p> \n  <p><b> Our Commitment to Diversity and Inclusion</b></p> \n  <p> At Databricks, we are committed to fostering a diverse and inclusive culture where everyone can excel. We take great care to ensure that our hiring practices are inclusive and meet equal employment opportunity standards. Individuals looking for employment at Databricks are considered without regard to age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other protected characteristics.</p> \n  <p><b> Compliance</b></p> \n  <div>\n    If access to export-controlled technology or source code is required for performance of job duties, it is within Employer's discretion whether to apply for a U.S. government license for such positions, and Employer may decline to proceed with an applicant on this basis alone.\n  </div>\n </div>\n</div>"},
{"page": 6, "position": 12, "title": "Senior Staff Software Engineer, Virtual IO Storage, Compute", "company": "Google", "date": "Just posted", "application_link": "https://www.indeed.com/m/basecamp/viewjob?viewtype=embedded&jk=89313dd92b655447", "description": "<div>\n Note: By applying to this position you will have an opportunity to share your preferred working location from the following: \n <b>Seattle, WA, USA; Sunnyvale, CA, USA</b>.\n <h3 class=\"jobSectionHeader\"><b> Minimum qualifications:</b></h3>\n <ul> \n  <li>Bachelor's degree or equivalent practical experience.<br> </li> \n  <li>8 years of experience in software development, and with data structures/algorithms.<br> </li> \n  <li>5 years of experience with design and architecture; and testing/launching software products.<br> </li> \n  <li>Experience with infrastructure systems and storage technologies.</li>\n </ul>\n <br> \n <h3 class=\"jobSectionHeader\"><b> Preferred qualifications:</b></h3>\n <ul> \n  <li>Experience in infrastructure as a service (IaaS).<br> </li> \n  <li>Experience with device drivers.<br> </li> \n  <li>Experience working with Virtualization as a technology.<br> </li> \n </ul>\n <div>\n  <h2 class=\"jobSectionHeader\"><b>About the job</b></h2>\n  <p> Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.<br> <br> With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.</p> \n  <p> In this role, you will work with virtual devices and hardware acceleration platforms, provide both local storage and the interface to replicated network-based storage access, and work towards exceptional performance and reliability.</p>\n  <p><br> Google Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.</p>\n  <p> The US base salary range for this full-time position is $231,000-$339,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.</p>\n </div>\n <div>\n  <h2 class=\"jobSectionHeader\"><b><br> Responsibilities</b></h2>\n  <ul> \n   <li>Provide long-term strategy for core storage features, SSDs, Offloads, reliability, and performance, working closely with partner teams to realize the strategy as it goes beyond the virtualization stack.<br> </li> \n   <li>Help craft the roadmap for the Storage Optimized VM family of products and provide technical assistance in execution and operations.<br> </li> \n   <li>Provide technical leadership to a growing team of engineers.<br> </li> \n   <li>Coordinate and communicate among multiple partner teams, including SSD hardware, Product Design, VM virtualization/hypervisor, and others.<br> </li> \n   <li>Help define the SSD roadmap for Compute products, taking into account offloads, security, SSD hardware, CPU architecture, etc.<br> </li> \n  </ul>\n </div>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.\n</div>"},
{"page": 6, "position": 11, "title": "Staff Software Engineer, Health Reporting Service, Google Cloud", "company": "Google", "date": "Just posted", "application_link": "https://www.indeed.com/m/basecamp/viewjob?viewtype=embedded&jk=751c74e4af8a5488", "description": "<div>\n <h3 class=\"jobSectionHeader\"><b>Minimum qualifications:</b></h3>\n <ul> \n  <li>Bachelor's degree or equivalent practical experience. </li>\n  <li>8 years of experience in software development, and with data structures/algorithms.<br> </li> \n  <li>5 years of experience testing, and launching software products, and 3 years of experience with software design and architecture.<br> </li> \n  <li>Experience with coding in data structures, algorithms, and software design.</li>\n </ul>\n <br> \n <h3 class=\"jobSectionHeader\"><b> Preferred qualifications:</b></h3>\n <ul> \n  <li>Master’s degree or PhD in Engineering, Computer Science, or a related technical field. </li>\n  <li>3 years of experience in a technical leadership role leading project teams and setting technical direction.</li> \n  <li>3 years of experience working in a complex, matrixed organization involving cross-functional or cross-business projects.<br> </li> \n  <li>Experience working with data scientists or ML engineers.<br> </li> \n </ul>\n <div>\n  <h2 class=\"jobSectionHeader\"><b>About the job</b></h2>\n  <p> Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.<br> <br> With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.</p> \n  <p> Google Compute Engine (GCE) Telemetry team plays a critical role in providing customers the information and tools necessary to understand and improve the overall performance of the compute instances. The Health Reporting Service team is building the platform to be the real-time source of truth for every GCE VM's health reporting.</p>\n  <p> Google Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.</p>\n  <p> The US base salary range for this full-time position is $185,000-$283,000+ bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. <br> <br> Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.</p>\n </div>\n <div>\n  <h2 class=\"jobSectionHeader\"><b><br> Responsibilities</b></h2>\n  <ul> \n   <li>Partner with engineering teams, SREs, and product management.<br> </li> \n   <li>Develop innovative technical solutions to generate and process VM observability data at a large scale in real-time.<br> </li> \n   <li>Support critical GCE customers to improve the overall reliability, usage, and performance of their compute instances.<br> </li> \n  </ul>\n </div>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.\n</div>"},
{"page": 6, "position": 10, "title": "FULL STACK SOFTWARE ENGINEER", "company": "University of Washington", "date": "Just posted", "application_link": "https://www.indeed.com/m/basecamp/viewjob?viewtype=embedded&jk=2bfa392f473e5cec", "description": "<div></div>\n<div>\n <div>\n  <div>\n   <div>\n    <div>\n     <div>\n      <div>\n       <div>\n        <div>\n         <div>\n          <div>\n           <div>\n            Benefits:\n           </div> \n           <div>\n            As a UW employee, you will enjoy generous benefits and work/life programs. For a complete description of our benefits for this position, please visit our website, click here. \n           </div>\n          </div>\n          <br> \n         </div>\n        </div>\n       </div>\n      </div>\n      <br> \n      <div>\n       <div>\n        As a UW employee, you have a unique opportunity to change lives on our campuses, in our state and around the world. UW employees offer their boundless energy, creative problem-solving skills and dedication to build stronger minds and a healthier world. \n        <br> \n        <br> UW faculty and staff also enjoy outstanding benefits, professional growth opportunities and unique resources in an environment noted for diversity, intellectual excitement, artistic pursuits and natural beauty. \n        <br> \n        <br> \n        <b>The School of Medicine has an outstanding opportunity for a Full Stack Software Engineer to join their team.</b> \n        <br> \n        <br> This position provides the opportunity to work as a member of the Software Solutions team in a remote/hybrid work environment. We are a small team, so you must be a self-starter, work collaboratively with team members, take pride in your work, and contribute to the overall success of the Software Solutions team. \n        <br> \n        <br> The Full Stack Software Developer (payroll title: Software Engineer) position is part of the dedicated Dean of Medicine IT team. This inspiring, challenging and rewarding work provides team members an opportunity to grow their careers, while making a difference in people’s lives, in our community and around the world. The role is primarily responsible for managing administrative applications that ensure legal compliance and facilitate digital record keeping within the School of Medicine. Ensuring that robust systems are in place for the finance business unit and school's department is critical, along with tools that facilitate decision support at all levels. The majority of mission critical reporting, data mining, and decision support solution architecting is dependent on this position. \n        <br> \n        <br> This position will serve a key role, working with commercial vendors, UW Information Technology (UW IT), and other internal business and technical staff to build, maintain, and to integrate a suite of school’s existing complex system of databases, applications, and reporting tools. \n        <br> \n        <br> The successful candidate will be responsible for supporting and enhancing these integrated systems in ensuing years. They will need to balance multiple competing priorities, clearly setting expectations while maintaining excellent customer relationships. \n        <br> \n        <br> This position will manage information systems upon which School of Medicine (SoM) business processes are dependent. It may interact with deans at all levels (vice-, associate-, assistant-); executives, and other business units to improve the quality of data and systems, to increase efficiency and collaboration in finance and administration, and to unify user experience for accessing School of Medicine resources. \n        <br> \n        <br> \n        <b>DUTIES AND RESPONSIBILITIES</b> \n        <br> \n        <br> Developer: \n        <br> \n        <li>Design, build, prototype, install, configure, test, modify and document functionality in-house applications as well as extend functionality of 3rd party systems </li>\n        <br> \n        <li>Develop and maintain reports, data visualization, and business intelligence solutions across multiple business functions including budgets, grants, admissions, grades, and promotions for students, staff, and faculty </li>\n        <br> \n        <li>Provide direct support or team consultations in support of existing applications and associated data infrastructure </li>\n        <br> \n        <br> System Analysis: \n        <br> \n        <li>Research and make proposals for handling new requirements for existing applications </li>\n        <br> \n        <li>Incrementally test systems in all stages of product development – using results to validate and refine development approach or business needs </li>\n        <br> \n        <li>Lead creation of end user documentation; technical support documentation; business/technical support plans </li>\n        <br> \n        <li>Develop and provide clients with decision-making guidelines/structures and required data </li>\n        <br> \n        <br> General: \n        <br> \n        <li>Foster and maintain excellent relationships with a wide variety of internal and external business and technical partners </li>\n        <br> \n        <li>Maintain knowledge of existing business processes and systems and be able to demonstrate their relationships to client needs </li>\n        <br> \n        <li>Identify and recommend options for meeting needs via existing resources/systems and or by enhancing/creating systems </li>\n        <br> \n        <li>Attend unit-wide meetings, advance technical and professional skills through continuing education and mentoring programs, and research and maintain knowledge of new technologies for departmental use </li>\n        <br> \n        <br> \n        <b>MINIMUM REQUIREMENTS</b> \n        <br> \n        <li>Bachelor's Degree in Computer Science, Engineering, or related IT field; equivalent experience may substitute for degree requirement. </li>\n        <br> \n        <br> 4-5 years prior experience with Software Development to include: \n        <br> \n        <li>Approximately 2 years demonstrated experience and expertise with ASP.NET, ASP.NET Core, .NET Framework </li>\n        <br> \n        <li>Approximately 2 years demonstrated experience and expertise with C# </li>\n        <br> \n        <li>Approximately 2 years demonstrated experience and expertise with SQL </li>\n        <br> \n        <br> Additional Requirements: \n        <br> \n        <li>Experience with object-relational mapping/Entity Framework </li>\n        <br> \n        <li>Experience with development architecture/frameworks such as MVC and Bootstrap </li>\n        <br> \n        <li>Experience with object oriented programming </li>\n        <br> \n        <li>Experience with ECMAScript (JavaScript), CSS, HTML5 </li>\n        <br> \n        <li>Demonstrated ability to work with minimum supervision as an individual contributor to projects and daily work </li>\n        <br> \n        <li>Strong sense of focus and attention to detail, flexibility, self-motivation, organizational skills, excellent written/oral communication skills, and ability to adapt to a range of technical and non-technical audiences </li>\n        <br> \n        <li>Demonstrated commitment to valuing diversity and contributing to an inclusive working and learning environment </li>\n        <br> \n        <br> \n        <i>Equivalent education and/or experience may substitute for minimum requirements. </i>\n        <br> \n        <br> \n        <b>DESIRED REQUIREMENTS</b> \n        <br> \n        <li>2 or more years of experience working in higher education, research, or health services organizations </li>\n        <br> \n        <li>Experience with reporting platform such as MS Reporting Services or Power BI </li>\n        <br> \n        <li>Experience with cloud computing (such as Azure, AWS, or serverless computing) and application virtualization/containers </li>\n        <br> \n        <li>Experience with both Agile and Waterfall development methodologies </li>\n        <br> \n        <li>Demonstrated expertise in developing code in additional languages (Python, C++, etc.) </li>\n        <br> \n        <li>Experience with Responsive design and development </li>\n        <br> \n        <li>An understanding of contemporary IT systems, network infrastructure and their interdependencies </li>\n        <br> \n        <li>Knowledge of compliance standards such as HIPAA and FERPA</li>\n        <br> \n        <br> \n        <li>Weekend and evening work sometimes required. </li>\n        <br> \n        <li>This position is open to anyone authorized to work in the U.S. The UW is not able to sponsor visas for staff positions. </li>\n        <br> \n        <br> Application Process: \n        <br> The application process for UW positions may include completion of a variety of online assessments to obtain additional information that will be used in the evaluation process. These assessments may include Work Authorization, Cover Letter and/or others. Any assessments that you need to complete will appear on your screen as soon as you select “Apply to this position”. Once you begin an assessment, it must be completed at that time; if you do not complete the assessment, you will be prompted to do so the next time you access your “My Jobs” page. If you select to take it later, it will appear on your \"My Jobs\" page to take when you are ready. \n        <b>Please note that your application will not be reviewed, and you will not be considered for this position until all required assessments have been completed.<br> </b>\n       </div>\n      </div>\n      <br> \n      <p></p>\n      <div>\n       <div>\n        <div>\n         <p>Committed to attracting and retaining a diverse staff, the University of Washington will honor your experiences, perspectives and unique identity. Together, our community strives to create and maintain working and learning environments that are inclusive, equitable and welcoming.</p> \n        </div>\n        <div>\n         <p>The University of Washington is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, age, protected veteran or disabled status, or genetic information.</p> \n         <p>To request disability accommodation in the application process, contact the Disability Services Office at 206-543-6450 or dso@uw.edu.</p> \n        </div>\n        <div>\n         <p>Applicants considered for this position will be required to disclose if they are the subject of any substantiated findings or current investigations related to sexual misconduct at their current employment and past employment. Disclosure is required under Washington state law.</p> \n        </div>\n        <div>\n         <b>COVID-19 VACCINATION REQUIREMENT</b> \n         <p>Employees of the University of Washington are required to be fully vaccinated against COVID-19 unless a medical or religious exemption is approved. Being fully vaccinated means that an individual is at least two weeks past their final dose of an authorized COVID-19 vaccine regimen. As a condition of employment, newly hired employees will be required to provide proof of their COVID-19 vaccination. View the Final candidate guide to COVID-19 vaccination requirement webpage for information about the medical or religious exemption process for final candidates.</p>\n        </div>\n       </div>\n      </div>\n     </div>\n    </div>\n   </div>\n  </div>\n </div>\n</div>\n<p></p>"},
{"page": 6, "position": 9, "title": "Back-End Software Engineer II", "company": "Microsoft", "date": "Just posted", "application_link": "https://www.indeed.com/m/basecamp/viewjob?viewtype=embedded&jk=37b1556c1015bcee", "description": "<div>\n <div>\n  The Identity &amp; Network Access Team builds and manages Microsoft’s online identity providers for all of Microsoft’s online services and platforms like Azure, Office, Xbox, and HoloLens. We boldly pursue big ideas that power transformational advances in online security and user management. Our work spans both the consumer and enterprise space and can be found in internet scale online services, the Windows operating system and most phones and handheld devices. Identity engineering employees have deep technical expertise, customer insights, and a clear point of view that comes from first-hand, very large-scale experience. We are engineers, technology leaders and experts, digital transformation change agents, and customer advocates.\n </div>\n <div></div>\n <div>\n  <br> Our team is seeking an experienced and passionate Backend Software Engineer II to join us as we create and deliver mission critical services and processes to enable Microsoft’s online presence. You will have the opportunity to design and develop creative, compelling, and cutting-edge systems that support our world-wide operations. You will develop software and services at scale, innovating on the latest technologies as the earliest adopters while mentoring other team members.\n </div>\n <div></div>\n <div>\n  <br> Also, our culture promotes diversity, multiculturalism, and inclusion and is clearly reflected in all of the things we do. Diversity is more than a commitment for us - it is the foundation of what we do. Our team has a sense of accountability and provides its members with many opportunities for learning and career growth.\n </div>\n <div></div>\n <div>\n  <br> We have exciting opportunities for you to innovate, influence, transform, inspire and grow within our organization and we encourage you to apply to learn more!\n </div>\n <div></div>\n <h2 class=\"jobSectionHeader\"><b><br> Responsibilities</b></h2>\n <div>\n  <b> Responsibilities:</b>\n </div>\n <ul>\n  <li> Design and develop large scale distributed software services and solutions.</li>\n  <li> Adhere to and drive modern software engineering practices through design reviews.</li>\n  <li> System design through well-defined interfaces across multiple components, code reviews, leveraging data/telemetry to make decisions.</li>\n  <li> Develop “best-in-class” engineering for our services by ensuring that the services and the components are well-defined and modularized, secure, reliable, diagnosable, actively monitored and reusable.</li>\n  <li> Improve test coverage for services, organize and implement integration tests, and resolve problem areas.</li>\n  <li> Consider testability, portability/monitoring, reliability, and maintainability, and understand when code is ready to be shared and delivered.</li>\n  <li> Gain a working understanding of Microsoft businesses and collaborate with mentors and leaders to contribute to cohesive, end-to-end experiences for our users.</li>\n  <li> Focus on customer/partner needs through a data driven approach.</li>\n  <li> Troubleshoot and optimize automation, reliability, and monitoring for Live Site.</li>\n </ul>\n <h2 class=\"jobSectionHeader\"><b> Qualifications</b></h2>\n <div>\n  <b> Required/Minimum Qualifications:</b>\n </div>\n <ul>\n  <li> Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, or Python \n   <ul>\n    <li>OR equivalent experience.</li>\n   </ul></li>\n  <li> 1+ years of Back-End Focused Engineering Experience</li>\n </ul>\n <div>\n  <b> Other Requirements:</b>\n </div>\n <div></div>\n <div>\n  <br> Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n </div>\n <ul>\n  <li> Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.</li>\n </ul>\n <div>\n  <b> Additional or Preferred Qualifications:</b>\n </div>\n <ul>\n  <li> Familiarity with Application (HTTP/HTTPS) &amp; Transport/Security (TCP/UDP, TLS) Protocols.</li>\n  <li> Experience using React.js or Rust Programming Languages</li>\n  <li> Expertise in any modern continuous delivery/deployment system</li>\n </ul>\n <div></div>\n <div>\n  <br> Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n </div>\n <div>\n  <br> Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n </div>\n <div></div>\n <div>\n  <br> Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n </div>\n <div></div>\n <div>\n  <br> Benefits/perks listed may vary depending on the nature of your employment with Microsoft and the country where you work.\n </div>\n <div></div>\n <div>\n  <br> #IdentityJobs #MSFTSecurity\n </div>\n</div>"},
{"page": 6, "position": 8, "title": "Software Dev Engineer Test-II", "company": "Kforce", "date": "Just posted", "application_link": "https://www.indeed.com/m/basecamp/viewjob?viewtype=embedded&jk=1efcbd46eacad3d8", "description": "<b>RESPONSIBILITIES:</b>\n<br> Kforce has a client that is seeking a Software Dev Engineer Test-II in Seattle, WA. \n<br>\n<br> \n<b>Key Tasks:</b>\n<br> \n<ul> \n <li>Software Dev Engineer Test-II will design, develop, implement, test, document and deliver large-scale, multi-tiered, distributed software applications, tools, systems, and services using multi-threaded programming, distributed programming in Java and C++, JDBC, SQL, Object Oriented design and design patterns, Oracle, and middleware messaging systems in a Linux environment</li> \n <li>Assist in gathering and analyzing business and functional requirements, and translate requirements into technical specifications for robust, scalable, supportable solutions that work well within the overall system architecture</li> \n <li>Own delivery of entire piece of system or application, and serve as technical lead on complex projects using best practice engineering standards</li> \n <li>As a Software Dev Engineer Test-II, you will produce comprehensive, usable software documentation</li> \n <li>Participate in a 24x7 on-call support rotation and travel for onsite troubleshooting or project launch</li> \n</ul> \n<b>REQUIREMENTS:</b>\n<br> \n<ul> \n <li>MS degree in Computer Science, Computer or Electrical Engineering, Mathematics, or a related field, plus one year of experience or related occupations of Software Engineer, Software Developer</li> \n <li>Employer will accept Bachelor's degree in Computer Science, Computer or Electrical Engineering, Mathematics, or a related field plus five years of progressively responsible experience in the specialty as equivalent to the Master's degree</li> \n <li>Experience or related occupation must involve multi-threaded programming and distributed programming in Java or C++ on Linux</li> \n <li>Experience must also involve JDBC, SQL, and Object-Oriented design and design patterns</li> \n <li>Requires availability for travel and 24x7 on-call support rotation</li> \n</ul> The pay range is the lowest to highest compensation we reasonably in good faith believe we would pay at posting for this role. We may ultimately pay more or less than this range. Employee pay is based on factors like relevant education, qualifications, certifications, experience, skills, seniority, location, performance, union contract and business needs. This range may be modified in the future. \n<br>\n<br> We offer comprehensive benefits including medical/dental/vision insurance, HSA, FSA, 401(k), and life, disability &amp; ADD insurance to eligible employees. Salaried personnel receive paid time off. Hourly employees are not eligible for paid time off unless required by law. Hourly employees on a Service Contract Act project are eligible for paid sick leave. \n<br>\n<br> \n<b>Note:</b> Pay is not considered compensation until it is earned, vested and determinable. The amount and availability of any compensation remains in Kforce's sole discretion unless and until paid and may be modified in its discretion consistent with the law. \n<br>\n<br> This job is not eligible for bonuses, incentives or commissions. \n<br>\n<br> Kforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."},
{"page": 6, "position": 6, "title": "Software Engineer", "company": "Microsoft", "date": "Today", "application_link": "https://www.indeed.com/m/basecamp/viewjob?viewtype=embedded&jk=904e28d4ccfb85a4", "description": "<div>\n <div>\n  Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us to achieve our mission. To learn more please visit: https://careers.microsoft.com/mission-culture.\n </div>\n <h2 class=\"jobSectionHeader\"><b> Responsibilities</b></h2>\n <div>\n   We value people who can bring a diverse perspective to our product and where a developer will not just write code, but will have a meaningful impact on the direction of the product and which features to build. We are building a team where diversity of thought and background is valued as much as technical skills, and where everyone is encouraged to come up with new ideas to make our customers’ lives better.\n </div>\n <div></div>\n <div>\n  <br> We are looking for talented early-to-mid career Software Engineers to help us deliver highly scalable services and world-class product experiences. You will have opportunities to work on multiple layers of the technology stack, ranging from customer-focused user experience work, building scalable distributed cloud services, working with big data, machine learning, and everything in between. You will learn how to design services and experiences that are required to work around the globe. You will collaborate with team members and other engineering groups in Microsoft to build full stack web applications and services using the latest web technologies in a dynamic and agile environment. You will be part of a fun-loving, diverse team that seeks challenges, loves learning and values teamwork. You will have opportunities for mentorship, career growth, and work on high-business impact areas.\n </div>\n <div>\n  <br> \n </div>\n <div>\n  <b><i>By applying to this position, you are being considered for multiple like positions within our organization for an invitation-only virtual Interview Day.</i></b>\n  <b><i> </i></b>\n  <b><i>Position specifics, including hiring team, location, and position details will be determined following the interview process.</i></b>\n </div>\n <h2 class=\"jobSectionHeader\"><b> Qualifications</b></h2>\n <div>\n  <b> Required/Minimum Qualifications</b>\n </div>\n <ul>\n  <li> Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n   <ul>\n    <li> OR equivalent experience</li>\n   </ul></li>\n </ul>\n <p></p>\n <div>\n  <b><br> Other Requirements:</b>\n </div>\n <div></div>\n <div>\n  <br> Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n </div>\n <div></div>\n <ul>\n  <li><br> Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.</li>\n </ul>\n <p></p>\n <div>\n  <b><br> Additional or Preferred Qualifications</b>\n </div>\n <ul>\n  <li> Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n   <ul>\n    <li> OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python</li>\n    <li> OR equivalent experience.</li>\n   </ul></li>\n </ul>\n <div></div>\n <div>\n  <br> Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. \n  <br> There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n </div>\n <div>\n   Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. \n  <br> There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n  <br> \n  <br> Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n </div>\n <div></div>\n <div>\n  <br> Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n </div>\n <div></div>\n <div>\n  <br> Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\n </div>\n</div>"}
]